{
  "basic_info": {
    "description_header": "Hey, I'm Jace...",
    "description": "As a seasoned presales engineer with a robust background in technology, I've consistently thrived on the pulse of innovation, leveraging technical expertise to drive business solutions. Now, having successfully completed a comprehensive coding bootcamp, I am embarking on a new chapter to transition into a role as a skilled coder. My journey into coding is fueled by a deep-seated passion for problem-solving and a relentless drive for continuous learning. Throughout my career, I've honed my ability to understand complex technical concepts and effectively communicate them to diverse audiences, a skill set that seamlessly translates into the world of software development. With a foundation in presales engineering, I bring a unique perspective to coding, combining technical acumen with a keen understanding of customer needs and market trends. I am adept at identifying opportunities for innovation and crafting solutions that not only meet but exceed expectations. As I venture into this new domain, I am committed to upholding the highest standards of craftsmanship and professionalism. I am eager to contribute my diverse skill set to a dynamic team, where I can collaborate with like-minded individuals to tackle challenges head-on and drive impactful results. I am actively seeking opportunities to apply my newfound coding skills in a role where I can continue to grow, learn, and make a meaningful impact. I am enthusiastic about the possibilities that lie ahead and am ready to embrace the exciting journey of becoming a proficient coder. Let's connect and explore how my unique blend of experience and newfound coding expertise can add value to your team and propel us towards shared success.",
    "section_name": {
      "about": "About me",
      "projects": "Projects",
      "skills": "Skills",
      "experience": "Experience"
    }
  },
    "projects": [
      {
        "title": "Animal Shelter",
        "startDate": "2020",
        "description": "The most expanded application I had opportunity to work with. I've learned many technologies and my code was reviewed by awesome curator. Application handles all adoption processess and allows to store all evidence on adopting animals from animal shelter.",
        "images": [
          "images/portfolio/animal-shelter/p1.jpg",
          "images/portfolio/animal-shelter/p2.jpg"
        ],
        "url": "",
        "technologies": [
          {
            "class": "devicon-angularjs-plain",
            "name": "Angular"
          },
          {
            "class": "devicon-typescript-plain",
            "name": "TypeScript"
          },
          {
            "class": "devicon-csharp-plain",
            "name": "C#"
          }
        ]
      },
      {
        "title": "Photography",
        "startDate": "2018",
        "description": "Personal project for study subject. I was responsible for testing photography application that optimizes images with popular algorithms used by graphic editors like Pixlr or Adobe Photoshop. I've earned A grade :)",
        "images": [
          "images/portfolio/photography/p1.jpg",
          "images/portfolio/photography/p2.jpg"
        ],
        "url": "https://github.com",
        "technologies": [
          {
            "class": "devicon-react-original",
            "name": "React"
          },
          {
            "class": "devicon-javascript-plain",
            "name": "JavaScript"
          }
        ]
      },
      {
        "title": "3D Object Viewer",
        "startDate": "2015",
        "description": "One of the first apps I was working on my internship. I had to develop front-end implementation for app that shows 3D models of known buildings. This was also my first project in Angular framework. I've learned a lot!",
        "images": [
          "images/portfolio/adventure/p1.jpg",
          "images/portfolio/adventure/p2.jpg"
        ],
        "url": "https://github.com",
        "technologies": [
          {
            "class": "devicon-angularjs-plain",
            "name": "Angular"
          },
          {
            "class": "devicon-typescript-plain",
            "name": "TypeScript"
          },
          {
            "class": "devicon-csharp-plain",
            "name": "C#"
          }
        ]
      }
    ],
    "experience": [
      {
        "company": "DefOpenSource",
        "title": "Front-End Developer",
        "years": "10.2019 - present",
        "mainTech": [
          "Angular 8/9/10"
        ],
        "technologies": [
          "REST API",
          "RxJS",
          "JavaScript",
          "Bootstrap",
          "MDBootstrap",
          "EF Core",
          ".NET Core",
          "SignalR",
          "Angular Material"
        ]
      },
      {
        "company": "Serros Solutions",
        "title": "Intern",
        "years": "01.2018 - 09.2019",
        "mainTech": [
          "Angular 7/8"
        ],
        "technologies": [
          "RxJS",
          "Django",
          "PHP",
          "JavaScript",
          "DHTMLX Gantt"
        ]
      }
    ]
  }
