{
  "basic_info": {
    "description_header": "Hey, I'm Jace...",
    "description": "As a seasoned presales engineer with a robust background in technology, I've consistently thrived on the pulse of innovation, leveraging technical expertise to drive business solutions. Now, having successfully completed a comprehensive coding bootcamp, I am embarking on a new chapter to transition into a role as a skilled coder. My journey into coding is fueled by a deep-seated passion for problem-solving and a relentless drive for continuous learning. Throughout my career, I've honed my ability to understand complex technical concepts and effectively communicate them to diverse audiences, a skill set that seamlessly translates into the world of software development. With a foundation in presales engineering, I bring a unique perspective to coding, combining technical acumen with a keen understanding of customer needs and market trends. I am adept at identifying opportunities for innovation and crafting solutions that not only meet but exceed expectations. As I venture into this new domain, I am committed to upholding the highest standards of craftsmanship and professionalism. I am eager to contribute my diverse skill set to a dynamic team, where I can collaborate with like-minded individuals to tackle challenges head-on and drive impactful results. I am actively seeking opportunities to apply my newfound coding skills in a role where I can continue to grow, learn, and make a meaningful impact. I am enthusiastic about the possibilities that lie ahead and am ready to embrace the exciting journey of becoming a proficient coder. Let's connect and explore how my unique blend of experience and newfound coding expertise can add value to your team and propel us towards shared success.",
    "section_name": {
      "about": "About me",
      "projects": "Projects",
      "skills": "Skills",
      "experience": "Experience"
    }
  },
    "projects": [
      {
        "title": "TorTrak",
        "startDate": "2024",
        "description": "TorTrak provides a comprehensive and user-friendly solution for visualizing historical tornado occurrences on an interactive map, utilizing JavaScript with chart.js and Leaflet libraries to allow users to plot every recorded tornado onto the map and ascertain impacts on specific areas like residences or workplaces. It features meticulous mapping of tornado paths, interactive charts for statistical analysis of tornado patterns and trends, high-quality map overlays for precise risk assessment, and customizable filters for tailored analyses, empowering users with the data needed for informed tornado preparedness and emergency planning.",
        "images": [
          "images/portfolio/tortrak/tortrakCode.png",
          "images/portfolio/tortrak/tortrak1.png",
          "images/portfolio/tortrak/tortrak2.png",
          "images/portfolio/tortrak/Tortrak3.png"
        ],
        "url": "https://tortrak.beardedjace.com/",
        "technologies": [
          {
            "class": "devicon-javascript-plain",
            "name": "JavaScript"
          },
          {
            "class": "devicon-html5-plain",
            "name": "HTML 5"
          },
          {
            "class": "devicon-css3-plain",
            "name": "CSS 3"
          },
          {
            "name": "VSCode",
            "class": "devicon-visualstudio-plain"
          }
        ]
      },
      {
        "title": "Pat's Salmon Cookies",
        "startDate": "2024",
        "description": "Pat's Salmon Cookies was one of the inaugural projects I tackled during my coding bootcamp; this imaginative application simulates the daily operations of a cookie store, where users can specify their expected hourly sales of cookies, and based on these inputs, the application dynamically generates a comprehensive table that displays the projected sales for each hour alongside the cumulative sales for the entire day. This project was instrumental in bolstering my proficiency in JavaScript, introduced me to essential programming concepts such as dynamically updating content in response to user inputs, and I gained hands-on experience with JavaScript’s core constructs, including arrays, objects, and functions, which are fundamental to manipulating data and structuring applications; furthermore, Pat’s Salmon Cookies provided a practical framework for understanding how to capture and process user input effectively, showcasing the real-world utility of interactive web applications, and through this project, I not only refined my technical skills but also developed a deeper appreciation for the intricacies of web development.",
        "images": [
          "images/portfolio/salmon/salmon1.png",
          "images/portfolio/salmon/salmon2.png",
          "images/portfolio/salmon/salmon3.png"
        ],
        "url": "https://cookie-stand.beardedjace.com/",
        "technologies": [
          {
            "class": "devicon-javascript-plain",
            "name": "JavaScript"
          },
          {
            "class": "devicon-html5-plain",
            "name": "HTML 5"
          },
          {
            "class": "devicon-css3-plain",
            "name": "CSS 3"
          },
          {
            "name": "VSCode",
            "class": "devicon-visualstudio-plain"
          }
        ]
      },
      {
        "title": "Odd-Duck",
        "startDate": "2024",
        "description": "Odd-Duck is one of the first applications I developed during my student days. This engaging web app is designed with a simple yet interactive concept: users click on their favorite images from a selection presented in each round. As participants navigate through various rounds, they choose images that appeal to them the most. At the conclusion of all rounds, Odd-Duck compiles and displays the results, revealing the images that received the most selections. This project not only allowed me to explore and implement basic user interactions but also served as an excellent introduction to handling dynamic content and user inputs in a web environment.",
        "images": [
          "images/portfolio/oddduck/oddduckCode.png",
          "images/portfolio/oddduck/oddduck1.png",
          "images/portfolio/oddduck/oddduck2.png",
          "images/portfolio/oddduck/oddduck3.png"
        ],
        "url": "https://odd-duck.beardedjace.com/",
        "technologies": [
          {
            "class": "devicon-javascript-plain",
            "name": "JavaScript"
          },
          {
            "class": "devicon-html5-plain",
            "name": "HTML 5"
          },
          {
            "class": "devicon-css3-plain",
            "name": "CSS 3"
          },
          {
            "name": "VSCode",
            "class": "devicon-visualstudio-plain"
          }
        ]
      }
    ],
    "experience": [
      {
        "company": "ReliTech",
        "title": "Regional Sales Director",
        "years": "01.2019 - 12.2023",
        "mainTech": [
          "Salesforce",
          "Productivity Suite"
        ],
        "technologies": [
          "Salesforce",
          "Productivity Suite",
          "CRM",
          "SaaS",
          "PaaS",
          "IaaS",
          "Cloud Computing",
          "Business Intelligence",
          "Data Analytics",
          "Data Visualization",
          "Data Warehousing",
          "Data Mining",
          "Machine Learning",
          "Artificial Intelligence",
          "IoT",
          "Blockchain",
          "Cybersecurity",
          "Kanban",
          "Microservices",
          "Docker",
          "Ansible",
          "Chef",
          "Puppet",
          "Slack",
          "Zoom",
          "Teams",
          "Skype",
          "Outlook",
          "Word",
          "Excel",
          "PowerPoint",
          "Access",
          "OneNote",
          "Visio",
          "Project",
          "SharePoint",
          "Teams",
          "OneDrive",
          "Azure",
          "AWS",
          "GCP",
          "Salesforce Cloud"
        ]
      },
      {
        "company": "Dell EMC",
        "title": "TSR - Technical Sales Representative III Preferred Accounts",
        "years": "07.2017 - 01.2019",
        "mainTech": [
          "Salesforce"
        ],
        "technologies": [
          "Salesforce",
          "CRM",
          "SaaS",
          "PaaS",
          "IaaS",
          "Cloud Computing",
          "Business Intelligence",
          "Data Analytics",
          "Data Visualization",
          "Data Warehousing",
          "Data Mining",
          "Machine Learning",
          "Artificial Intelligence",
          "IoT",
          "Blockchain",
          "Cybersecurity",
          "Kanban",
          "Microservices",
          "Docker",
          "Ansible",
          "Chef",
          "Puppet",
          "Slack",
          "Zoom",
          "Teams",
          "Skype",
          "Outlook",
          "Word",
          "Excel",
          "PowerPoint",
          "Access",
          "OneNote",
          "Visio",
          "Project",
          "SharePoint",
          "Teams",
          "OneDrive",
          "Azure",
          "AWS",
          "GCP",
          "Salesforce Cloud"
        ]
      }
    ]
  }
